Revit 2026 API

# AnalyticalCurveSelector Enumeration

---

Specifies which portion of an Analytical Curve is of interest.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalCurveSelector
```
```vb
Public Enumeration AnalyticalCurveSelector
```
```cpp
public enum class AnalyticalCurveSelector
```
```fsharp
type AnalyticalCurveSelector
```

| Member name | Value | Description |
| --- | --- | --- |
| EndPoint | 1 | End of curve (corresponds to end = 1). |
| StartPoint | 0 | Start of curve (corresponds to end = 0). |
| WholeCurve | 2 | Entire curve. |

#### Reference

Autodesk.Revit.DB.Structure Namespace